/*3. Объявить две целочисленные переменные a и b и задать им произвольные начальные значения. 
Затем написать скрипт, который работает по следующему принципу:

если a и b положительные, вывести их разность;
если а и b отрицательные, вывести их произведение;
если а и b разных знаков, вывести их сумму;
ноль можно считать положительным числом. */
 
'use strict'

const a = 19;
const b = 4;

if (a,b => 0) {
    console.log( a-b);
}
else if (a,b < 0) {
    console.log(a*b);
}

else {
    console(a+b);
}